# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [40]:

series1 = pd.Series(np.random.randint(1,4,101))
series2 = pd.Series(np.random.randint(1,3,101))
series3 = pd.Series(np.random.randint(10000,30000,101))
print(series1)
print(series2)
print(series3)

0      1
1      2
2      3
3      2
4      2
      ..
96     3
97     1
98     2
99     3
100    2
Length: 101, dtype: int64
0      2
1      2
2      2
3      1
4      2
      ..
96     2
97     2
98     2
99     1
100    2
Length: 101, dtype: int64
0      29635
1      26715
2      18957
3      28260
4      15471
       ...
96     28331
97     23262
98     20861
99     29759
100    19804
Length: 101, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [41]:
df= pd.DataFrame({"S1": series1, "S2": series2, "S3": series3})
df

     S1  S2     S3
0     1   2  29635
1     2   2  26715
2     3   2  18957
3     2   1  28260
4     2   2  15471
..   ..  ..    ...
96    3   2  28331
97    1   2  23262
98    2   2  20861
99    3   1  29759
100   2   2  19804

[101 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [42]:
df.rename(columns = {"S1":"bedrs","S2":"bathrs", "S3":"price_sqr_meter"}, inplace = True)
df

     bedrs  bathrs  price_sqr_meter
0        1       2            29635
1        2       2            26715
2        3       2            18957
3        2       1            28260
4        2       2            15471
..     ...     ...              ...
96       3       2            28331
97       1       2            23262
98       2       2            20861
99       3       1            29759
100      2       2            19804

[101 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [48]:

data = {"S1": series1, "S2": series2, "S3": series3}

df2 = pd.concat(data,axis=0)
df2.rename(index={0:"bigcolumn"})

S1  bigcolumn        1
    1                2
    2                3
    3                2
    4                2
                 ...
S3  96           28331
    97           23262
    98           20861
    99           29759
    100          19804
Length: 303, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [50]:
newindex = np.arange(0,299)
df.reindex(newindex)

     bedrs  bathrs  price_sqr_meter
0      1.0     2.0          29635.0
1      2.0     2.0          26715.0
2      3.0     2.0          18957.0
3      2.0     1.0          28260.0
4      2.0     2.0          15471.0
..     ...     ...              ...
294    NaN     NaN              NaN
295    NaN     NaN              NaN
296    NaN     NaN              NaN
297    NaN     NaN              NaN
298    NaN     NaN              NaN

[299 rows x 3 columns]